/* 
API কি ? API কেন ব্যবহার করা হয়?

আজকে আমরা আলোচনা করব API কি?(what is API)। ইপিআই(API) অর্থ হচ্ছে application programming interface.


API কি সেটা বোঝার আগে একটি উদাহরণ দেওয়া যাক। ধরুন আপনি একটা কোম্পানি চালান। সেই কোম্পানির জন্য একটি ওয়েবসাইট তৈরি করলেন। ওয়েবসাইটি তৈরি করার পর আপনি খেয়াল করলেন যে আপনার বেশিভাগ কাস্টমার ওয়েবসাইট ব্যবহার করতে পছন্দ করে না। তাদের একটি মোবাইল অ্যাপ্লিকেশন দরকার ।


তো আপনি একটি মোবাইল অ্যাপ্লিকেশন বানাতে গেলেন। আপনার কোম্পানির মে ডাটাগুলো আছে সেগুলো দিয়ে একটি মোবাইল অ্যাপ্লিকেশন তৈরি করবে। আপনার server-side এর যে লজিক আছে সেগুলো দিয়ে একটি মোবাইল অ্যাপ্লিকেশন বানাবেন।


কিন্তু  ওই একই সার্ভার এবং একই ডাঁটা দিয়ে মোবাইল অ্যাপ্লিকেশন বানাইতে গেলেন। তখন কি হলো আপনার মোবাইলেও সার্ভারের এইচটিএমএল জাভাস্ক্রিপ্ট সিএসএস রিটার্ন করে। অর্থাৎ যখন আপনি সার্ভারে রিকুয়েস্ট পাঠান তখনই সার্ভার HTML JavaScript CSS ডাটা পাঠায়। কিন্তু এগুলো তো আপনার দরকার না। এগুলো দিয়ে আপনি মোবাইল ফোনে কি করব।


আবার আরেকটা  বিষয় চিন্তা করেন যে আপনার কোম্পানি অনেক বড় হয়ে গেল। আর আপনার কোম্পানী থেকে অনেকগুলো সাব কোম্পানি তৈরি হলো। 


এই সাব কোম্পানিগুলোতে আপনার কাস্টমারদের কিছু কিছু ডাটা এক্সেস দিবেন। যে, যদি উনি আমার কাস্টমার হয় আপনি উনাকে এত শতাংশ করে ছাড় দিবেন। কিন্তু এটার জন্য তো আপনার কাস্টমারের ইনফর্মেশন ওদেরকে দিতে হবে। সেটাই বা আপনি কিভাবে দিবেন।


এই দুইটা সমস্যার সমাধান আমরা একটা মাধ্যমে দিতে পারেন। সেটা হচ্ছে API(application programming interface). কিন্তু কিভাবে? ওকে আমি ভেঙ্গে বলি।



ওয়েবসাইট বানানোর ক্ষেত্রে সার্ভার থেকে আমরা কী করি। সার্ভার মূলত আমাদের HTML JavaScript CSS ফাইল তৈরি করে  দে। কিন্তু আমরা যদি এইচটিএমএল জাভাস্ক্রিপ্ট সিএসএস এর পুরো ফাইলটা না নিয়ে সার্ভার থেকে শুধু এইটুকুই ডাটা নেই যেটুকু ডাটা আমাদের দরকার, তাহলে কেমন হয়?



মনে করুন  প্রোফাইল পেজের জন্য ইমেজ লাগবে  তাহলে শুধু  ইমেজের  লিংকট নিব। নাম লাগবে তাহলে শুধু নামটা নিব কয়জন ফ্রেন্ড আছে শুধু ফ্রেন্ডলিস্ট নিব। এই অল্প কিছু ডাটা লাগবে এগুলাই শূধু নিব।। পুরো এইচটিএমএল সিএসএস জাভাস্ক্রিপ্ট ফাইল না নিয়ে শুধুমাত্র যে যে কনটেন্টগুলো আমার লাগবে সেগুলোর ডাটা নিব। 


যখন একটা সার্ভার এরকম  ভাবে শুধু প্রয়োজনীয় কনটেন্ট গুলো শেয়ার করবে তখন শেয়ার করার এই পুরো প্রক্রিয়াটাকে বলা হয়  API। 
*/